# gunicorn_config.py

import multiprocessing

# --- تنظیمات اتصال ---
bind = "0.0.0.0:5000"

# --- معماری پردازش (حیاتی برای SSE) ---
# برای اینکه سیستم چت و کنترل ریموت درست کار کند، همه باید به یک حافظه متصل باشند.
# بنابراین فقط ۱ ورکر مجاز است، اما با تردینگ بسیار بالا.
workers = 1

# استفاده از gevent برای مدیریت هزاران اتصال همزمان (Non-blocking)
worker_class = "gevent"

# تعداد اتصالات همزمان که یک ورکر می‌تواند هندل کند
worker_connections = 1000

# --- تنظیمات زمانی ---
# تایم‌اوت بالا برای اینکه استریم موزیک یا SSE قطع نشود
timeout = 120  
keepalive = 5

# --- تنظیمات لاگ ---
accesslog = "-"  # چاپ در کنسول
errorlog = "-"
loglevel = "info"

# نام پروسه (برای نمایش در دستور top یا htop)
proc_name = "Lyraz_player"